code-review/NRB_3471_3546/База_Было/DataProcessors/ОбработкаЗапросовПоНалогамОтДиасофт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаЗапросовПоНалогамОтДиасофт</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ПлатежнаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлатежнаяОперация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВнешнегоИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленныйНалог</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачисленныйНалог</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаДохода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НачисленныйНалог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачисленныйНалог</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалоговаяБазаВыплатыДоходов</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаПоСтавке15СПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ1СИЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаЗНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогОбычнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаПовышенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаИПДНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаСОИДН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкиНалогаУстановленыВРучномРежиме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ОбработкаЗапросовПоНалогамОтДиасофт/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура выгружает в Кафка данные по налогам за заданный период
//
// Параметры:
//  НачалоПериода		 - Дата - начало периода получения данных
//  КонецПериода		 - Дата - конец периода получения данных
//  УИДСообщенияЗапроса	 - Строка - ГУИД исходного сообщения запроса (MessageId)
//  ТекстыОшибок		 - Массив - коллекция для накапливания текстов об ошибках в процессе выгрузки
//
Процедура ВыгрузитьДанныеПоНалогам(НачалоПериода, КонецПериода, УИДСообщенияЗапроса, ТекстыОшибок = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныхПоНалогам();
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	ВидыОперацииПоручений = Новый Массив;
	ВидыОперацииПоручений.Добавить(Справочники.ВидыОпераций.НачислениеДивидендов);
	ВидыОперацииПоручений.Добавить(Справочники.ВидыОпераций.ПогашениеНКД);
	ВидыОперацииПоручений.Добавить(Справочники.ВидыОпераций.ПогашениеЦБПолное);
	ВидыОперацииПоручений.Добавить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
	Запрос.УстановитьПараметр("ВидыОперацииПоручений", ВидыОперацииПоручений);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВыгрузитьДанныеПоНалогу(Неопределено, УИДСообщенияЗапроса, ТекстыОшибок);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		ВыгрузитьДанныеПоНалогу(Выборка, УИДСообщенияЗапроса, ТекстыОшибок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьДанныеПоНалогу(ПараметрыВыгрузки, УИДСообщенияЗапроса, ТекстыОшибок)
	
	Сущность = "OperationTax";
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiTaxInfo1655;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	Успешно = Ложь;
	ОтправляемыйОбъект = ?(ПараметрыВыгрузки = Неопределено, Неопределено, ПараметрыВыгрузки.ВыплатаДохода);
	
	Попытка
		ТекстJSON = СформироватьJSON(УИДСообщения, УИДСообщенияЗапроса, Сущность, ПараметрыВыгрузки);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, ОтправляемыйОбъект);
		Успешно = Истина;
	Исключение
		Успешно = Ложь;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Если ТипЗнч(ТекстыОшибок) = Тип("Массив") Тогда
			ТекстыОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Функция ТекстЗапросаДанныхПоНалогам()
	Возврат
	"ВЫБРАТЬ
	|	Поручение.ВидОперацииД КАК ВидОперацииПоручения,
	|	Поручение.Валюта.Код КАК ПоручениеКодВалюты,
	|	ПоручениеЦенныеБумагиСписываемые.Сумма КАК ПоручениеСумма,
	|	ЕСТЬNULL(ЦенныеБумаги.ISIN, """") КАК ISIN,
	|	ЕСТЬNULL(ЦенныеБумаги.НомерРегистрации, """") КАК НомерРегистрацииЦБ,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК КодЗагрузкиЦБ,
	|	ЕСТЬNULL(ЮридическиеЛицаЭмитентов.ИНН, """") КАК ЭмитентИНН,
	|	ЕСТЬNULL(ЮридическиеЛицаЭмитентов.TIN, """") КАК ЭмитентTIN,
	|	ПлатежнаяОперацияВыплатаДохода.Ссылка КАК ВыплатаДохода,
	|	ПлатежнаяОперацияВыплатаДохода.Дата КАК ВыплатаДоходаДата,
	|	ПлатежнаяОперацияВыплатаДохода.Номер КАК ВыплатаДоходаНомер,
	|	ПлатежнаяОперацияВыплатаДохода.GUIDПлатежа КАК ВыплатаДоходаИдентификаторПлатежа,
	|	ЕСТЬNULL(КодыЗагрузкиКлиентов.Код, """") КАК ВыплатаДоходаКодКлиента,
	|	ЕСТЬNULL(НачисленныйНалогПоПоручению.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК НачисленныйНалогДата,
	|	ЕСТЬNULL(ПлатежнаяОперацияОплатаНалога.ДокументВнешнегоИсточника, """") КАК ОплатаНалогаДокументВнешнегоИсточника,
	|	ЕСТЬNULL(ПлатежнаяОперацияОплатаНалога.НомерПлатежногоПоручения, """") КАК ОплатаНалогаНомерПлатежногоПоручения,
	|	ЕСТЬNULL(ПлатежнаяОперацияОплатаНалога.Сумма, 0) КАК ОплатаНалогаСумма,
	|	ЕСТЬNULL(ПлатежнаяОперацияОплатаНалога.СтавкаНалога, 0) КАК ОплатаНалогаСтавка
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ПО Поручение.Ссылка = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|			И (Поручение.Проведен)
	|			И (Поручение.ВидОперацииД В (&ВидыОперацииПоручений))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяОперация КАК ПлатежнаяОперацияВыплатаДохода
	|		ПО Поручение.Ссылка = ПлатежнаяОперацияВыплатаДохода.Основание
	|			И (ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо = ПлатежнаяОперацияВыплатаДохода.РазделСчетаДепо)
	|			И (ПлатежнаяОперацияВыплатаДохода.Проведен)
	|			И (ПлатежнаяОперацияВыплатаДохода.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (ПлатежнаяОперацияВыплатаДохода.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхОпераций.ВыплатаДохода))
	|			И (ПлатежнаяОперацияВыплатаДохода.Получатель.Резидент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО (ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага = ЦенныеБумаги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛицаЭмитентов
	|		ПО (ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица = ЮридическиеЛицаЭмитентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага = КодыЗагрузкиЦБ.Владелец)
	|			И (КодыЗагрузкиЦБ.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (НЕ КодыЗагрузкиЦБ.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузкиЦБ.ДатаОкончанияДействия > &КонецПериода
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиентов
	|		ПО (ПлатежнаяОперацияВыплатаДохода.Получатель.ЮридическиеФизическиеЛица = КодыЗагрузкиКлиентов.Владелец)
	|			И (КодыЗагрузкиКлиентов.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты))
	|			И (НЕ КодыЗагрузкиКлиентов.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузкиКлиентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузкиКлиентов.ДатаОкончанияДействия > &КонецПериода
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачисленныйНалог КАК НачисленныйНалогПоПоручению
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежнаяОперация КАК ПлатежнаяОперацияОплатаНалога
	|			ПО НачисленныйНалогПоПоручению.Ссылка = ПлатежнаяОперацияОплатаНалога.НачисленныйНалог
	|				И (НачисленныйНалогПоПоручению.Проведен)
	|				И (ПлатежнаяОперацияОплатаНалога.Проведен)
	|		ПО Поручение.Ссылка = НачисленныйНалогПоПоручению.Основание
	|			И (ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо = НачисленныйНалогПоПоручению.РазделСчетаДепо)
	|			И (НачисленныйНалогПоПоручению.Проведен)";
КонецФункции

#Область Kafka

Функция СформироватьJSON(УИДСообщения, УИДСообщенияЗапроса, Сущность, ПараметрыВыгрузки)
		
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, "INS", "1.0.0", УИДСообщения);
	MessageInfo.MasterMessageId = УИДСообщенияЗапроса;
	
	Data = ДанныеData(ПараметрыВыгрузки, Сущность);
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеData(ПараметрыВыгрузки, Сущность)
	
	Если ПараметрыВыгрузки = Неопределено Тогда
		ДанныеПоОперациямИНалогам = Неопределено;
	Иначе
		ТипыКодовОпераций = Новый Соответствие;
		ТипыКодовОпераций.Вставить(Справочники.ВидыОпераций.НачислениеДивидендов, "ACDIV");
		ТипыКодовОпераций.Вставить(Справочники.ВидыОпераций.ПогашениеНКД, "RACI");
		ТипыКодовОпераций.Вставить(Справочники.ВидыОпераций.ПогашениеЦБПолное, "FSFULL");
		ТипыКодовОпераций.Вставить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное, "FSPART");
		
		ДанныеПоОперациямИНалогам = Новый Массив;
		Пока ПараметрыВыгрузки.Следующий() Цикл
			
			ДанныеПоЦБ = Новый Структура;
			ДанныеПоЦБ.Вставить("Isin", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ISIN));
			ДанныеПоЦБ.Вставить("AssetCode", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.КодЗагрузкиЦБ));
			ДанныеПоЦБ.Вставить("RegNum", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.НомерРегистрацииЦБ));
			ДанныеПоЦБ.Вставить("INNIssuer", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ЭмитентИНН));
			ДанныеПоЦБ.Вставить("TINIssuer", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ЭмитентTIN));
			
			ИнформацияОВидеОперации = Новый Структура;
			ИнформацияОВидеОперации.Вставить("TypeCode", ТипыКодовОпераций[ПараметрыВыгрузки.ВидОперацииПоручения]);
			ИнформацияОВидеОперации.Вставить("TradeNum", ПараметрыВыгрузки.ВыплатаДоходаНомер);
			ИнформацияОВидеОперации.Вставить("FactDate", ПараметрыВыгрузки.ВыплатаДоходаДата);
			ИнформацияОВидеОперации.Вставить("CurrencyCode", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ПоручениеКодВалюты));
			ИнформацияОВидеОперации.Вставить("Amount", ПараметрыВыгрузки.ПоручениеСумма);
			ИнформацияОВидеОперации.Вставить("Asset", ДанныеПоЦБ);
			
			ИнформацияОВидеОперацииМассив = Новый Массив;
			ИнформацияОВидеОперацииМассив.Добавить(ИнформацияОВидеОперации);
			
			PDocDate = ДатаОплатыНалога(ПараметрыВыгрузки.ОплатаНалогаДокументВнешнегоИсточника);
			
			ДанныеПоОперацииИНалогу = Новый Структура;
			ДанныеПоОперацииИНалогу.Вставить("OperationID", ПараметрыВыгрузки.ВыплатаДоходаИдентификаторПлатежа);
			ДанныеПоОперацииИНалогу.Вставить("CRMClientID", ЗначениеНеобязательногоПоля(СокрЛП(ПараметрыВыгрузки.ВыплатаДоходаКодКлиента)));
			ДанныеПоОперацииИНалогу.Вставить("Amount", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ОплатаНалогаСумма));
			ДанныеПоОперацииИНалогу.Вставить("Rate", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ОплатаНалогаСтавка));
			ДанныеПоОперацииИНалогу.Вставить("RegDate", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.НачисленныйНалогДата));
			ДанныеПоОперацииИНалогу.Вставить("PDocDate", ЗначениеНеобязательногоПоля(PDocDate));
			ДанныеПоОперацииИНалогу.Вставить("PDocNum", ЗначениеНеобязательногоПоля(ПараметрыВыгрузки.ОплатаНалогаНомерПлатежногоПоручения));
			ДанныеПоОперацииИНалогу.Вставить("OperationData", ИнформацияОВидеОперацииМассив);
			
			ДанныеПоОперациямИНалогам.Добавить(ДанныеПоОперацииИНалогу);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеКОтправке = Новый Структура;
	ДанныеКОтправке.Вставить("TaxData", ДанныеПоОперациямИНалогам);
	
	Возврат ДанныеКОтправке;
	
КонецФункции

Функция ЗначениеНеобязательногоПоля(Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Возврат СокрЛП(Значение);
		Иначе
			Возврат Значение;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ДатаОплатыНалога(ПредставлениеДокумента)
	
	ДатаОплатыНалога = Дата(1, 1, 1);
	Если Не ЗначениеЗаполнено(ПредставлениеДокумента) Тогда
		Возврат ДатаОплатыНалога;
	КонецЕсли;
	
	ПозицияОт = СтрНайти(ПредставлениеДокумента, "от");
	ОтступДаты = 2;
	СтрокаСДатой = Сред(ПредставлениеДокумента, ПозицияОт + ОтступДаты);
	МассивЧастиДатыСоВременем = СтрРазделить(СтрокаСДатой, " ", Ложь);
	Если СтрНайти(МассивЧастиДатыСоВременем[0], "/") > 0 Тогда
		МассивЧастиДаты = СтрРазделить(МассивЧастиДатыСоВременем[0], "/");
		СтрокаФормата = "ЧЦ=2; ЧВН=";
		Буфер = МассивЧастиДаты[0];
		МассивЧастиДаты[0] = Формат(Число(МассивЧастиДаты[1]), СтрокаФормата);
		МассивЧастиДаты[1] = Формат(Число(Буфер), СтрокаФормата);
		СтрокаСДатой = СтрСоединить(МассивЧастиДаты, ".");
		МассивЧастиДатыСоВременем[0] = СтрокаСДатой;
	КонецЕсли;
	
	Результат = Новый Массив;
	Результат.Добавить(МассивЧастиДатыСоВременем[0]);
	Если МассивЧастиДатыСоВременем.Количество() > 1 Тогда
		Если МассивЧастиДатыСоВременем[1] = "0:00:00" Тогда
			МассивЧастиДатыСоВременем[1] = "0" + МассивЧастиДатыСоВременем[1];
		КонецЕсли;
		Результат.Добавить(МассивЧастиДатыСоВременем[1]);
	КонецЕсли;
	
	СтрокаСДатой = СтрСоединить(Результат, " ");
	Попытка
		ДатаОплатыНалога = СтроковыеФункцииКлиентСервер.СтрокаВДатуСоВременем(СтрокаСДатой);
	Исключение
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = "Не удалось определить дату оплаты налога (PDocDate) из строки: " + ПредставлениеДокумента + Символы.ПС
			+ ПодробноеПредставлениеОшибки;
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат ДатаОплатыНалога;
	
КонецФункции

#КонецОбласти

#КонецОбласти
